###########################################
## 클래스 정의, 인스턴스 생성
'''
class 붕어빵틀:
    pass

내빵 = 붕어빵틀()
너빵 = 붕어빵틀()

내빵.앙꼬 = "딸기맛"
너빵.앙꼬 = "딸기맛"

print(id(내빵.앙꼬))
print(id(너빵.앙꼬))
'''
###########################################
## 연습문제 삼성차 
'''
class 삼성차:
    pass

내차 = 삼성차()
너차 = 삼성차()

내차.차종 = 'SM5'
너차.차종 = 'QM6'

print(내차.차종)
print(너차.차종)

'''
###########################################
## 연습문제 계좌
'''
class 계좌:
    pass

내계좌 = 계좌()
너계좌 = 계좌()

내계좌.이름 = '김철수'
내계좌.잔고 = 500

너계좌.이름 = '이영희'
너계좌.잔고 = 1000

print(내계좌.잔고 + 너계좌.잔고)
print(f'{내계좌.이름}님의 잔고는 {내계좌.잔고}입니다.')

'''

####################################################
## 붕어빵틀 (메서드)
'''
class 붕어빵틀:
    def 앙꼬넣기(어떤빵, 앙꼬):
        어떤빵.앙꼬 = 앙꼬

내빵 = 붕어빵틀()
너빵 = 붕어빵틀()


붕어빵틀.앙꼬넣기(내빵, "딸기맛")
붕어빵틀.앙꼬넣기(너빵, "초코맛")

print(내빵.앙꼬)
print(너빵.앙꼬)
'''

############################################################
## 계좌 (메서드)
'''
class 계좌:
    def 개설(누구계좌, 이름, 잔고):
        누구계좌.이름 = 이름
        누구계좌.잔고 = 잔고

    def 출력(누구계좌):
        print(f'{누구계좌.이름}님의 잔고는 {누구계좌.잔고}원 입니다.')

내계좌 = 계좌()
너계좌 = 계좌()

계좌.개설(내계좌, '김철수', 500)
계좌.개설(너계좌, '이영희', 1000)

계좌.출력(내계좌)
계좌.출력(너계좌)
#print(내계좌.잔고 + 너계좌.잔고)
#print(f'{내계좌.이름}님의 잔고는 {내계좌.잔고}입니다.')
'''

##################################################
## 붕어빵틀 (생성자)
'''
class 붕어빵틀:
    def __init__(self, 앙꼬):
        self.앙꼬 = 앙꼬

내빵 = 붕어빵틀("딸기맛")
'''

####################################################
## 사람 클래스 (생성자)
'''
class 사람:
    def __init__(self, 이름, 생년월일, 성별):
        self.이름 = 이름
        self.생년월일 = 생년월일
        self.성별 = 성별

    def 정보출력(self):
        print(f'{self.생년월일[:4]} 년 {self.생년월일[4:6]} 월 {self.생년월일[6:]} 일 출생')
        print(f'({self.성별}) {self.이름}')


내정보 = 사람('유종훈', '19860302', '남')
내정보.정보출력()
'''


#############################################
## 비행기 클래스 (생성자)
'''
class 비행기:
    def __init__(self, 기종):
        self.기종 = 기종

    def 이륙(self):
        print(f'{self.기종} 이륙합니다.')

비행기1 = 비행기('보잉787')
비행기1.이륙()
'''


########################################################
## 계좌클래스(생성자)
'''
class 계좌:
    def __init__(self, 이름, 잔고):
        self.이름 = 이름
        self.잔고 = 잔고

    def 출력(self):
        print(f'{self.이름}님의 잔고는 {self.잔고}원 입니다.')

내계좌 = 계좌('김철수', 500)
너계좌 = 계좌('이영희', 1000)


내계좌.출력()
너계좌.출력()
'''
'''
class 붕어빵틀:
    def __init__(self, 앙꼬):
        self.앙꼬 = 앙꼬

    def __add__(self, other):
        return (f'{self.앙꼬}와 {other.앙꼬}가 모두 들어있는 붕어빵')
    
    def __eq__(self, other):
        return (self.앙꼬 == other.앙꼬)
    
    def __str__(self):
        return (f'{self.앙꼬} 맛 붕어빵 입니다.')

내빵 = 붕어빵틀("딸기맛")
너빵 = 붕어빵틀("딸기맛")

print(내빵 + 너빵)
print(내빵 == 너빵)
print(내빵)
print(너빵)
'''
'''
a = 'python'
b = str('python')

print(a, type(a), id(a))
print(b, type(b), id(b))
'''
'''
class 보병:
    def __init__(self):
        self.speed = 5
        self.size = 3

class 마린(보병):
    def __init__(self):
        super().__init__()
        self.attack = 3

class 파이어뱃(보병):
    def __init__(self):
        super().__init__()
        self.attack = 5

m = 마린()
f = 파이어뱃()

print('m', m.speed, m.size, m.attack)
print('f', f.speed, f.size, f.attack)
'''
#################################################
## 클래스 실습

class 계좌:
    def __init__(self, 이름, 잔고):
        self.이름 = 이름
        self.잔고 = 잔고
        self.내역 = []

    def 입금하기(self, 입금액):
        self.잔고 += 입금액
        self.내역.append(f'입금: {입금액:>7}원    잔고:{self.잔고:>7}원')
    
    def 출금하기(self, 출금액):
        self.잔고 -= 출금액
        self.내역.append(f'출금: {출금액:>7}원    잔고:{self.잔고:>7}원')

    def 이체하기(self, 받는사람, 보낸금액):
        self.잔고 -= 보낸금액
        받는사람.잔고 += 보낸금액

        self.내역.append(f'출금: {보낸금액:>7}원    잔고:{self.잔고:>7}원')
        받는사람.내역.append(f'입금: {보낸금액:>7}원    잔고:{받는사람.잔고:>7}원')

    def 통장정리(self):
        print('------------------------------')
        print('  통 장 정 리 ')
        print('------------------------------')
        print(f'{self.이름}님 환영합니다.')
        print(f'잔고: {self.잔고:>7}원')
        print('------------------------------')

        for i in self.내역:
            print(i)


내계좌 = 계좌('김철수', 500)
너계좌 = 계좌('이영희', 1000)

내계좌.입금하기(500)
내계좌.입금하기(200)
내계좌.입금하기(1000)
내계좌.출금하기(300)
내계좌.이체하기(너계좌, 700)

너계좌.출금하기(200)

내계좌.통장정리()
너계좌.통장정리()
